Importing all necessary modules

In [237]:
try:
    import pandas as pd
    import numpy as np
    import matplotlib.pyplot as plt   
    # import time
    # import sys
    print("all modules imported succesfully")
except Exception as e:
    print(e)
    exit()

all modules imported succesfully

# Pandas Tutorial Code

### Creating Series

Using List

In [238]:
list1 = [_ for _ in range(11,66,11)]
ser_form_list1 = pd.Series(list1)
ser_form_list1

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [239]:
list2 = [11,22,"priyang",44,1.33]
ser_form_list2 = pd.Series(list2)
ser_form_list2

0         11
1         22
2    priyang
3         44
4       1.33
dtype: object

Using Tuple

In [240]:
tuple1 = (_ for _ in range(11,66,11))
ser_form_tuple1 = pd.Series(tuple1)
ser_form_tuple1

0    11
1    22
2    33
3    44
4    55
dtype: int64

Using Dictionary

In [241]:
dict1 = {i-1:11*i for i in range(1,6)}
ser_form_dict1 = pd.Series(dict1)
ser_form_dict1

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [242]:
dict2 = {1:11,3:22,5:22,7:33,10:44,12:55}
ser_form_dict2 = pd.Series(dict2)
ser_form_dict2

1     11
3     22
5     22
7     33
10    44
12    55
dtype: int64

Using Numpy Array

In [243]:
numpy_arr1 = np.arange(11,66,11)
ser_form_numpy_arr1 = pd.Series(numpy_arr1)
ser_form_numpy_arr1

0    11
1    22
2    33
3    44
4    55
dtype: int32

Using Scalar Value

In [244]:
scalar_value = 11
ser_form_scalar_value = pd.Series(scalar_value,index=[_ for _ in range(6)])
ser_form_scalar_value

0    11
1    11
2    11
3    11
4    11
5    11
dtype: int64

### Series with custom index

In [245]:
ser_form_list1_cus_idx = pd.Series(list1,index=[chr(97+i) for i in range(5)],dtype=float)
ser_form_list1_cus_idx

a    11.0
b    22.0
c    33.0
d    44.0
e    55.0
dtype: float64

### Accessing Values via Slicing

In [246]:
ser_form_list1[0]

11

In [247]:
ser_form_list1[0:2]

0    11
1    22
dtype: int64

### Operation on Pandas Series

In [248]:
op_s1 = pd.Series([i for i in range(1,6)])
op_s2 = pd.Series([10*i for i in range(1,6)])

In [249]:
op_s1+op_s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [250]:
op_s1-op_s2

0    -9
1   -18
2   -27
3   -36
4   -45
dtype: int64

In [251]:
op_s1*op_s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [252]:
op_s1/op_s2

0    0.1
1    0.1
2    0.1
3    0.1
4    0.1
dtype: float64

In [253]:
(op_s1+op_s2)**2

0     121
1     484
2    1089
3    1936
4    3025
dtype: int64

If 2 Series have unequal number of element then<br/>
remaining elements will give nan on operations

In [254]:
op_s1+op_s2[:op_s2.size-1]

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

### Creating DataFrame

Using List

In [255]:
df_from_list1 = pd.DataFrame([_ for _ in range(11,66,11)])
df_from_list1

    0
0  11
1  22
2  33
3  44
4  55

Using Nested List

In [256]:
df_from_list2 = pd.DataFrame([["Priyang",98],["Vedant",89],["Parshav",88]])
df_from_list2

         0   1
0  Priyang  98
1   Vedant  89
2  Parshav  88

Using Dictionary

In [257]:
dict2 = {"Name":["Priyang","Aadhaya","krishna"],"Marks":[98,89,99]}
df_from_dict = pd.DataFrame(dict2)
df_from_dict

      Name  Marks
0  Priyang     98
1  Aadhaya     89
2  krishna     99

Using Numpy Array

In [258]:
arr_for_df =  np.arange(1,10).reshape(3,-1)
df_from_np_array = pd.DataFrame(arr_for_df,
                columns=[chr(i+97) for i in range(arr_for_df.shape[1])], ## cols
                index=[i for i in range(arr_for_df.shape[0])]) ## no of rows
df_from_np_array

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Using Series

In [259]:
dict3 = {
    'First':pd.Series([chr(97+i) for i in range(4)]),
    'Second':pd.Series([chr(ord('w')+i) for i in range(4)])
}

df_from_series = pd.DataFrame(dict3)
df_from_series

  First Second
0     a      w
1     b      x
2     c      y
3     d      z

### Dataframe with Custom Index

In [260]:
df_cus_idx = pd.DataFrame(dict2,index=["stu"+str(i) for i in range(1,4)])
df_cus_idx

         Name  Marks
stu1  Priyang     98
stu2  Aadhaya     89
stu3  krishna     99

In [261]:
list3 = [["Priyang",98],["Vedant",89],["Parshav",88]]

df_cus_via_nes_lst = pd.DataFrame(list3,
                    columns=["Name","Marks"],
                    index=[11*(i+1) for i in range(len(list3))]) 
df_cus_via_nes_lst

       Name  Marks
11  Priyang     98
22   Vedant     89
33  Parshav     88

QUESTION SET1

In [262]:
list4 = [["Ahmeddabad",40.1],["Anand",35.2],["Baroda",38.5]]
pd.DataFrame(list4,columns=["City","Temp"],index=[1,2,3])

         City  Temp
1  Ahmeddabad  40.1
2       Anand  35.2
3      Baroda  38.5

### Attributes of Pandas Dataframe

In [263]:
dict_for_df1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82],
               }
df_from_dict1=pd.DataFrame(dict_for_df1,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])

df_from_dict1

         Name  Marks
stu1  Priyang     98
stu2   Aadhya     89
stu3   Krisha     99
stu4   Vedant     87
stu5   Parshv     90
stu6   Mittal     83
stu7  Archana     82

In [264]:
df_from_dict1.shape

(7, 2)

In [265]:
df_from_dict1.head(2)

         Name  Marks
stu1  Priyang     98
stu2   Aadhya     89

In [266]:
df_from_dict1.tail(2)

         Name  Marks
stu6   Mittal     83
stu7  Archana     82

In [267]:
df_from_dict1.columns

Index(['Name', 'Marks'], dtype='object')

In [268]:
df_from_dict1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, stu1 to stu7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
dtypes: int64(1), object(1)
memory usage: 168.0+ bytes

In [269]:
df_from_dict1['Name']

stu1    Priyang
stu2     Aadhya
stu3     Krisha
stu4     Vedant
stu5     Parshv
stu6     Mittal
stu7    Archana
Name: Name, dtype: object

In [270]:
df_from_dict1.Name

stu1    Priyang
stu2     Aadhya
stu3     Krisha
stu4     Vedant
stu5     Parshv
stu6     Mittal
stu7    Archana
Name: Name, dtype: object

In [271]:
df_from_dict1[['Name','Marks']]

         Name  Marks
stu1  Priyang     98
stu2   Aadhya     89
stu3   Krisha     99
stu4   Vedant     87
stu5   Parshv     90
stu6   Mittal     83
stu7  Archana     82

In [272]:
df_from_dict1['Marks'].min()

82

In [273]:
df_from_dict1['Marks'].max()

99

In [274]:
df_from_dict1['Marks'].mean()

89.71428571428571

In [275]:
df_from_dict1.describe()

           Marks
count   7.000000
mean   89.714286
std     6.676184
min    82.000000
25%    85.000000
50%    89.000000
75%    94.000000
max    99.000000

In [276]:
df_from_dict1['Marks'].value_counts()

Marks
98    1
89    1
99    1
87    1
90    1
83    1
82    1
Name: count, dtype: int64

In [277]:
dict_for_df2 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[99,89,99,87,99,87,82],
               }
df_from_dict2=pd.DataFrame(dict_for_df2,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])

df_from_dict2["Marks"].value_counts()

Marks
99    3
87    2
89    1
82    1
Name: count, dtype: int64

In [278]:
df_from_dict2.count()

Name     7
Marks    7
dtype: int64

In [279]:
df_from_dict2['Marks'].count()

7

### Lov vs Iloc

loc[rows i want,cloumns i want]

In [280]:
dict_for_df3 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82],
                'Grades':["AA","AB","AA","AB","AC","BA","BB"],
               }
df_from_dict3=pd.DataFrame(dict_for_df3)
df_from_dict3

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB

In [281]:
df_from_dict3.loc[0,:]

Name      Priyang
Marks          98
Grades         AA
Name: 0, dtype: object

In [282]:
df_from_dict3.loc[[0,1,2],:],df_from_dict3.loc[0:2,:],

(      Name  Marks Grades
 0  Priyang     98     AA
 1   Aadhya     89     AB
 2   Krisha     99     AA,
       Name  Marks Grades
 0  Priyang     98     AA
 1   Aadhya     89     AB
 2   Krisha     99     AA)

In [283]:
df_from_dict3.loc[:,"Name"]

0    Priyang
1     Aadhya
2     Krisha
3     Vedant
4     Parshv
5     Mittal
6    Archana
Name: Name, dtype: object

In [284]:
df_from_dict3.loc[:,['Name','Marks']]

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

In [285]:
df_from_dict3.loc[:,'Name':]

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB

In [286]:
df_from_dict3.loc[:,'Marks':]

   Marks Grades
0     98     AA
1     89     AB
2     99     AA
3     87     AB
4     90     AC
5     83     BA
6     82     BB

iloc[First Inclusive,Last Exclusive] access by integer positions

In [287]:
df_from_dict3.iloc[:,0]

0    Priyang
1     Aadhya
2     Krisha
3     Vedant
4     Parshv
5     Mittal
6    Archana
Name: Name, dtype: object

In [288]:
df_from_dict3.iloc[:,0:2]

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

In [289]:
df_from_dict3.index = ['stu'+str(i) for i in range(1,df_from_dict3.shape[0]+1)]
df_from_dict3

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC
stu6   Mittal     83     BA
stu7  Archana     82     BB

Question Set 2

In [290]:
df_from_dict3.loc[['stu1','stu2'],:]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB

In [291]:
df_from_dict3.loc['stu1':'stu4','Name']

stu1    Priyang
stu2     Aadhya
stu3     Krisha
stu4     Vedant
Name: Name, dtype: object

In [292]:
df_from_dict3.iloc[:2,:2]

         Name  Marks
stu1  Priyang     98
stu2   Aadhya     89

In [293]:
df_from_dict3.iloc[:3,:3]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA

BY loc

In [294]:
df_from_dict3.loc[:'stu2',:]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB

In [295]:
df_from_dict3.loc[['stu'+str(i) for i in range(1,7,2)],['Name','Grades']]

         Name Grades
stu1  Priyang     AA
stu3   Krisha     AA
stu5   Parshv     AC

In [296]:
df_from_dict3.loc[:'stu7',:]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC
stu6   Mittal     83     BA
stu7  Archana     82     BB

By iloc

In [297]:
df_from_dict3.iloc[:2,:]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB

In [298]:
df_from_dict3.iloc[0:5:2,0:3:2]

         Name Grades
stu1  Priyang     AA
stu3   Krisha     AA
stu5   Parshv     AC

In [299]:
df_from_dict3.iloc[[0,2,4],[0,1]]

         Name  Marks
stu1  Priyang     98
stu3   Krisha     99
stu5   Parshv     90

In [300]:
df_from_dict3.iloc[0:7,:]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC
stu6   Mittal     83     BA
stu7  Archana     82     BB

### at vs iat

iat

In [301]:
df_from_dict3.iat[1,2]

'AB'

In [302]:
df_from_dict3.iat[4,1] = 99
df_from_dict3

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     99     AC
stu6   Mittal     83     BA
stu7  Archana     82     BB

at

In [303]:
df_from_dict3.at['stu2','Grades']

'AB'

In [304]:
df_from_dict3.at['stu5','Name']

'Parshv'

In [305]:
df_from_dict3.at['stu5','Marks'] = 99
df_from_dict3.at['stu5','Marks']

99

Reseting stu5 marks for  further code nothing else

In [306]:
df_from_dict3.at['stu5','Marks'] = 90

### Accessing values with Boolean Array

In [307]:
dict_for_df4 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv'],
                'Marks':[98,89,99,87,90],
                'Grades':["AA","AB","AA","AB","AC"],
               }
df_from_dict4=pd.DataFrame(dict_for_df4)
df_from_dict4.index = ['stu'+str(i) for i in range(1,df_from_dict4.shape[0]+1)]
df_from_dict4

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC

In [308]:
df_from_dict4.loc[[True,False,True,False,True]]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA
stu5   Parshv     90     AC

In [309]:
df_from_dict4.loc[[False,False,False,False,False],[False,False,False]]

Empty DataFrame
Columns: []
Index: []

In [310]:
df_from_dict4.loc[[True,False,False,False,True],[False,False,True]]

     Grades
stu1     AA
stu5     AC

In [311]:
df_from_dict4.loc[[False,False,False,True,False],[False,True,False]]

      Marks
stu4     87

Iloc works same as loc when boolean passed

In [312]:
df_from_dict4.iloc[[True,False,True,False,True]]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA
stu5   Parshv     90     AC

In [313]:
df_from_dict4.iloc[[False,False,False,False,False],[False,False,False]]

Empty DataFrame
Columns: []
Index: []

In [314]:
df_from_dict4.iloc[[True,False,False,False,True],[False,False,True]]

     Grades
stu1     AA
stu5     AC

In [315]:
df_from_dict4.iloc[[False,False,False,True,False],[False,True,False]]

      Marks
stu4     87

### Conditional Selection on Dataframe

In [316]:
c1=df_from_dict3['Marks'] > 90

In [317]:
df_from_dict3[c1]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

In [318]:
c2 = df_from_dict3['Grades']=='AB'
df_from_dict3[c2]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

In [319]:
c3 = (df_from_dict3['Grades']=='AB') & (df_from_dict3['Marks']>80)
df_from_dict3[c3]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

In [320]:
c4 = df_from_dict3['Marks']>90
df_from_dict3['Name'][c4]

stu1    Priyang
stu3     Krisha
Name: Name, dtype: object

In [321]:
df_from_dict3[c4]['Name']
# both are same this and above one

stu1    Priyang
stu3     Krisha
Name: Name, dtype: object

In [322]:
c5 = df_from_dict3['Grades']=="AB"
df_from_dict3['Name'][c5]

stu2    Aadhya
stu4    Vedant
Name: Name, dtype: object

By loc

In [323]:
c6 = df_from_dict3['Marks']>90
df_from_dict3.loc[c6]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

In [324]:
c7 = (df_from_dict3['Marks']>80)&(df_from_dict3['Grades']=="AB")
df_from_dict3.loc[c7]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

By iloc

In [325]:
df_from_dict3[df_from_dict3.iloc[:,1]>90]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

In [326]:
df_from_dict3[(df_from_dict3.iloc[:,1]>80) & (df_from_dict3.iloc[:,2]=="AB")]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

In [327]:
df_from_dict3[(df_from_dict3.iloc[:,2]=="AB")]['Name']

stu2    Aadhya
stu4    Vedant
Name: Name, dtype: object

In [328]:
df_from_dict1.index = [i for i in range(df_from_dict1.shape[0])]
df_from_dict1

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

### Add or Remove Column in Dataframe

Python List

In [329]:
df_add_li = ["AA","AB","AA","AB","AC","BA","BB"]
df_from_dict1['Grades1'] = df_add_li
df_from_dict1

      Name  Marks Grades1
0  Priyang     98      AA
1   Aadhya     89      AB
2   Krisha     99      AA
3   Vedant     87      AB
4   Parshv     90      AC
5   Mittal     83      BA
6  Archana     82      BB

Removing a column

In [330]:
# df_from_dict1.drop(columns='Grades1',axis=0,inplace=True)  
df_from_dict1.drop(columns='Grades1',inplace=True)  
## axis = 1 for column
## inplace = True to remove it permanently

In [331]:
df_from_dict1

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

In [332]:
ser_for_df = pd.Series(["AA","AB","AA","AB","AC","BA","BB"])
dict_for_df5 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82]}
      
df_from_dict5 = pd.DataFrame(dict_for_df5)
df_from_dict5

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

In [333]:
df_from_dict5['Grades2'] = ser_for_df
df_from_dict5

      Name  Marks Grades2
0  Priyang     98      AA
1   Aadhya     89      AB
2   Krisha     99      AA
3   Vedant     87      AB
4   Parshv     90      AC
5   Mittal     83      BA
6  Archana     82      BB

In [334]:
city_dict={'Anand':'Priyang','Ahmedabad':'Addhya',
   'Nadiad':'Krisha','Baroda':'Vedant',
   'khambhat':'Parshv',
   'Khambhat':'Mittal','Ahmedabad1':'Archana'}
df_from_dict5['City'] = city_dict
df_from_dict5 
# city_dict

      Name  Marks Grades2 City
0  Priyang     98      AA  NaN
1   Aadhya     89      AB  NaN
2   Krisha     99      AA  NaN
3   Vedant     87      AB  NaN
4   Parshv     90      AC  NaN
5   Mittal     83      BA  NaN
6  Archana     82      BB  NaN

In [335]:
df_from_dict5

      Name  Marks Grades2 City
0  Priyang     98      AA  NaN
1   Aadhya     89      AB  NaN
2   Krisha     99      AA  NaN
3   Vedant     87      AB  NaN
4   Parshv     90      AC  NaN
5   Mittal     83      BA  NaN
6  Archana     82      BB  NaN

In [336]:
dict_for_df6 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82]}
df_from_dict6 = pd.DataFrame(dict_for_df6)
df_from_dict6.insert(1,'grades3',ser_for_df)
df_from_dict6['name_grade'] = df_from_dict6['Name']+" "+df_from_dict6['grades3']

df_from_dict6

      Name grades3  Marks  name_grade
0  Priyang      AA     98  Priyang AA
1   Aadhya      AB     89   Aadhya AB
2   Krisha      AA     99   Krisha AA
3   Vedant      AB     87   Vedant AB
4   Parshv      AC     90   Parshv AC
5   Mittal      BA     83   Mittal BA
6  Archana      BB     82  Archana BB

In [337]:
ser_for_df1 = [11*i for i in range(len(ser_for_df))]
df_from_df = df_from_dict6.assign(Grades4 = ser_for_df,temp=ser_for_df1)
df_from_df

      Name grades3  Marks  name_grade Grades4  temp
0  Priyang      AA     98  Priyang AA      AA     0
1   Aadhya      AB     89   Aadhya AB      AB    11
2   Krisha      AA     99   Krisha AA      AA    22
3   Vedant      AB     87   Vedant AB      AB    33
4   Parshv      AC     90   Parshv AC      AC    44
5   Mittal      BA     83   Mittal BA      BA    55
6  Archana      BB     82  Archana BB      BB    66

In [338]:
df_from_df.assign(marks1=lambda x:x['Marks']+1)
#### or 
df_from_df.assign(marks1=df_from_df['Marks']+1)

      Name grades3  Marks  name_grade Grades4  temp  marks1
0  Priyang      AA     98  Priyang AA      AA     0      99
1   Aadhya      AB     89   Aadhya AB      AB    11      90
2   Krisha      AA     99   Krisha AA      AA    22     100
3   Vedant      AB     87   Vedant AB      AB    33      88
4   Parshv      AC     90   Parshv AC      AC    44      91
5   Mittal      BA     83   Mittal BA      BA    55      84
6  Archana      BB     82  Archana BB      BB    66      83

### Add or remove rows from dataframe

In [339]:
df_from_dict1

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

Using concat

In [340]:
df_for_concat1 = pd.DataFrame({'Name':'Anil','Marks':[99]})
concated_df1 = pd.concat([df_from_dict1,df_for_concat1],ignore_index=True)
concated_df1

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82
7     Anil     99

Using iloc

In [341]:
concated_df1.iloc[0] = ['Rnil',89]
concated_df1

      Name  Marks
0     Rnil     89
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82
7     Anil     99

Using iloc

In [342]:
concated_df1.loc[2] = ['Jil',79]
concated_df1

      Name  Marks
0     Rnil     89
1   Aadhya     89
2      Jil     79
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82
7     Anil     99

In [343]:
concated_df1.drop([0,2],inplace=True)
concated_df1.reset_index(drop=True)
concated_df1

      Name  Marks
1   Aadhya     89
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82
7     Anil     99

In [344]:
c8 = concated_df1[concated_df1['Marks']<90]
concated_df1.drop(c8.index)

     Name  Marks
4  Parshv     90
7    Anil     99

In [345]:
concated_df1

      Name  Marks
1   Aadhya     89
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82
7     Anil     99

### create csv file

In [356]:
df_from_dict3.index = [i for i in range(df_from_dict3.shape[0])]
df_from_dict3

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB

In [357]:
df_from_dict3.to_csv('csv_df.csv')

In [364]:
df_from_csv = pd.read_csv('csv_df.csv')
df_from_csv.drop(columns='Unnamed: 0',inplace=True)
df_from_csv

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB